{
    "class_name": "Model",
    "config": {
        "name": "model_2",
        "layers": [
            {
                "name": "input_3",
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        150
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "input_3"
                },
                "inbound_nodes": []
            },
            {
                "name": "embedding_2",
                "class_name": "Embedding",
                "config": {
                    "name": "embedding_2",
                    "trainable": false,
                    "batch_input_shape": [
                        null,
                        null
                    ],
                    "dtype": "float32",
                    "input_dim": 70293,
                    "output_dim": 100,
                    "embeddings_initializer": {
                        "class_name": "RandomUniform",
                        "config": {
                            "minval": -0.05,
                            "maxval": 0.05,
                            "seed": null,
                            "dtype": "float32"
                        }
                    },
                    "embeddings_regularizer": null,
                    "activity_regularizer": null,
                    "embeddings_constraint": null,
                    "mask_zero": false,
                    "input_length": null
                },
                "inbound_nodes": [
                    [
                        [
                            "input_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "bidirectional_2",
                "class_name": "Bidirectional",
                "config": {
                    "name": "bidirectional_2",
                    "trainable": true,
                    "dtype": "float32",
                    "layer": {
                        "class_name": "GRU",
                        "config": {
                            "name": "gru_2",
                            "trainable": true,
                            "dtype": null,
                            "return_sequences": true,
                            "return_state": false,
                            "go_backwards": false,
                            "stateful": false,
                            "unroll": false,
                            "time_major": false,
                            "units": 128,
                            "activation": "tanh",
                            "recurrent_activation": "hard_sigmoid",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null,
                                    "dtype": "float32"
                                }
                            },
                            "recurrent_initializer": {
                                "class_name": "Orthogonal",
                                "config": {
                                    "gain": 1.0,
                                    "seed": null,
                                    "dtype": "float32"
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {
                                    "dtype": "float32"
                                }
                            },
                            "kernel_regularizer": null,
                            "recurrent_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "recurrent_constraint": null,
                            "bias_constraint": null,
                            "dropout": 0.0,
                            "recurrent_dropout": 0.0,
                            "implementation": 1,
                            "reset_after": false
                        }
                    },
                    "merge_mode": "concat"
                },
                "inbound_nodes": [
                    [
                        [
                            "embedding_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "global_average_pooling1d_2",
                "class_name": "GlobalAveragePooling1D",
                "config": {
                    "name": "global_average_pooling1d_2",
                    "trainable": true,
                    "dtype": "float32",
                    "data_format": "channels_last"
                },
                "inbound_nodes": [
                    [
                        [
                            "bidirectional_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "global_max_pooling1d_2",
                "class_name": "GlobalMaxPooling1D",
                "config": {
                    "name": "global_max_pooling1d_2",
                    "trainable": true,
                    "dtype": "float32",
                    "data_format": "channels_last"
                },
                "inbound_nodes": [
                    [
                        [
                            "bidirectional_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "concatenate_2",
                "class_name": "Concatenate",
                "config": {
                    "name": "concatenate_2",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": -1
                },
                "inbound_nodes": [
                    [
                        [
                            "global_average_pooling1d_2",
                            0,
                            0,
                            {}
                        ],
                        [
                            "global_max_pooling1d_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "dense_2",
                "class_name": "Dense",
                "config": {
                    "name": "dense_2",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 1,
                    "activation": "sigmoid",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null,
                            "dtype": "float32"
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {
                            "dtype": "float32"
                        }
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            }
        ],
        "input_layers": [
            [
                "input_3",
                0,
                0
            ]
        ],
        "output_layers": [
            [
                "dense_2",
                0,
                0
            ]
        ]
    },
    "keras_version": "2.2.4-tf",
    "backend": "tensorflow"
}